balazsgrill/modembed/res/Devices/dsPIC33/PIC24HJ12GP201.PIC
<?xml version="1.0" ?><edc:PIC edc:arch="24xxxx" edc:desc="" edc:informedby="DOS PS DS" edc:isextended="false" edc:name="PIC24HJ12GP201" edc:procid="0xa3" xmlns:edc="http://crownking/edc" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://crownking/edc edc/PIC.xsd">
  <edc:Power>
    <edc:VPP edc:defaultvoltage="3.250" edc:maxvoltage="3.500" edc:minvoltage="3.000"/>
    <edc:VDD edc:maxdefaultvoltage="3.500" edc:maxvoltage="3.500" edc:mindefaultvoltage="3.000" edc:minvoltage="3.000" edc:nominalvoltage="3.250"/>
  </edc:Power>
  <edc:Programming edc:haschecksum="true" edc:memtech="ee" edc:tries="1">
    <edc:Wait edc:cfg="10000" edc:eedata="10000" edc:erase="600" edc:pgm="1000" edc:userid="10000"/>
    <edc:Latches edc:cfg="2" edc:eedata="2" edc:pgm="64"/>
  </edc:Programming>
  <edc:ArchDef edc:desc="24xxxx" edc:name="24xxxx">
    <edc:MemTraits>
      <edc:CodeMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xffffff" edc:wordsize="0x4"/>
      <edc:ExtCodeMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xffffff" edc:wordsize="0x4"/>
      <edc:BackgroundDebugMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xff7fff" edc:wordsize="0x4"/>
      <edc:TestMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xffffff" edc:wordsize="0x4"/>
      <edc:UserIDMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xffffff" edc:wordsize="0x4"/>
      <edc:ConfigFuseMemTraits edc:addrinc="0x2" edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:DeviceIDMemTraits edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:EEDataMemTraits edc:magicoffset="0x0"/>
      <edc:DataMemTraits edc:addrinc="0x2" edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0x0" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
    </edc:MemTraits>
  </edc:ArchDef>
  <edc:CodeGuard>
    <edc:SegRegion edc:segregion="Data">
      <edc:Seg edc:seg="General"/>
    </edc:SegRegion>
    <edc:SegRegion edc:segregion="Program">
      <edc:Seg edc:seg="Boot">
        <edc:SegNature edc:addr="0xffe" edc:id="PgmBootHighLarge" edc:segsecurity="High" edc:segsize="Large"/>
        <edc:SegNature edc:addr="0xffe" edc:id="HiLarBootCode" edc:segsecurity="High" edc:segsize="Large"/>
        <edc:SegNature edc:addr="0x7fe" edc:id="PgmBootHighMed" edc:segsecurity="High" edc:segsize="Medium"/>
        <edc:SegNature edc:addr="0x7fe" edc:id="HiMedBootCode" edc:segsecurity="High" edc:segsize="Medium"/>
        <edc:SegNature edc:addr="0x3fe" edc:id="PgmBootHighSm" edc:segsecurity="High" edc:segsize="Small"/>
        <edc:SegNature edc:addr="0x3fe" edc:id="HiSmBootCode" edc:segsecurity="High" edc:segsize="Small"/>
        <edc:SegNature edc:addr="0xffe" edc:id="PgmBootStdLarge" edc:segsecurity="Standard" edc:segsize="Large"/>
        <edc:SegNature edc:addr="0xffe" edc:id="StdLarBootCode" edc:segsecurity="Standard" edc:segsize="Large"/>
        <edc:SegNature edc:addr="0x7fe" edc:id="PgmBootStdMed" edc:segsecurity="Standard" edc:segsize="Medium"/>
        <edc:SegNature edc:addr="0x7fe" edc:id="StdMedBootCode" edc:segsecurity="Standard" edc:segsize="Medium"/>
        <edc:SegNature edc:addr="0x3fe" edc:id="PgmBootStdSm" edc:segsecurity="Standard" edc:segsize="Small"/>
        <edc:SegNature edc:addr="0x3fe" edc:id="StdSmBootCode" edc:segsecurity="Standard" edc:segsize="Small"/>
        <edc:SegNature edc:addr="0x0" edc:id="PgmBootNone" edc:segsecurity="None" edc:segsize="None"/>
        <edc:SegNature edc:addr="0x0" edc:id="NoBootCode" edc:segsecurity="None" edc:segsize="None"/>
        <edc:SegWriteProtect edc:disableid="PgmBootWrtProtectOff" edc:enableid="PgmBootWrtProtectOn"/>
      </edc:Seg>
      <edc:Seg edc:seg="General">
        <edc:SegNature edc:addr="0x1ffe" edc:id="PgmGenHigh" edc:segsecurity="High" edc:segsize="None"/>
        <edc:SegNature edc:addr="0x1ffe" edc:id="PgmGenStd" edc:segsecurity="Standard" edc:segsize="None"/>
        <edc:SegNature edc:addr="0x1ffe" edc:id="PgmGenNone" edc:segsecurity="None" edc:segsize="None"/>
        <edc:SegWriteProtect edc:disableid="PgmGenWrtProtectOff" edc:enableid="PgmGenWrtProtectOn"/>
      </edc:Seg>
    </edc:SegRegion>
  </edc:CodeGuard>
  <edc:WatchdogTimer edc:min="1"/>
  <edc:InterruptList>
    <edc:Trap edc:cname="ReservedTrap0" edc:desc="Reserved"/>
    <edc:Trap edc:cname="OscillatorFail" edc:desc="Oscillator Fail Trap Vector"/>
    <edc:Trap edc:cname="AddressError" edc:desc="Address Error Trap Vector"/>
    <edc:Trap edc:cname="StackError" edc:desc="Stack Error Trap Vector"/>
    <edc:Trap edc:cname="MathError" edc:desc="Math Error Trap Vector"/>
    <edc:Trap edc:cname="DMACError" edc:desc="DMAC Error Trap Vector"/>
    <edc:Trap edc:cname="ReservedTrap6" edc:desc="Reserved"/>
    <edc:Trap edc:cname="ReservedTrap7" edc:desc="Reserved"/>
    <edc:Interrupt edc:cname="INT0Interrupt" edc:desc="INT0 - External Interrupt 0" edc:irq="0"/>
    <edc:Interrupt edc:cname="IC1Interrupt" edc:desc="IC1 - Input Compare 1" edc:irq="1"/>
    <edc:Interrupt edc:cname="OC1Interrupt" edc:desc="OC1 - Output Compare 1" edc:irq="2"/>
    <edc:Interrupt edc:cname="T1Interrupt" edc:desc="T1 - Timer1" edc:irq="3"/>
    <edc:Interrupt edc:cname="IC2Interrupt" edc:desc="IC2 - Input Capture 2" edc:irq="5"/>
    <edc:Interrupt edc:cname="OC2Interrupt" edc:desc="OC2 - Output Compare 2" edc:irq="6"/>
    <edc:Interrupt edc:cname="T2Interrupt" edc:desc="T2 - Timer2" edc:irq="7"/>
    <edc:Interrupt edc:cname="T3Interrupt" edc:desc="T3 - Timer3" edc:irq="8"/>
    <edc:Interrupt edc:cname="SPI1ErrInterrupt" edc:desc="SPI1E - SPI1 Error" edc:irq="9"/>
    <edc:Interrupt edc:cname="SPI1Interrupt" edc:desc="SPI1 - SPI1 Transfer Done" edc:irq="10"/>
    <edc:Interrupt edc:cname="U1RXInterrupt" edc:desc="U1RX - UART1 Receiver" edc:irq="11"/>
    <edc:Interrupt edc:cname="U1TXInterrupt" edc:desc="U1TX - UART1 Transmitter" edc:irq="12"/>
    <edc:Interrupt edc:cname="ADC1Interrupt" edc:desc="ADC1 - A/D Converter 1" edc:irq="13"/>
    <edc:Interrupt edc:cname="SI2C1Interrupt" edc:desc="SI2C1 - I2C1 Slave Events" edc:irq="16"/>
    <edc:Interrupt edc:cname="MI2C1Interrupt" edc:desc="MI2C1 - I2C1 Master Events" edc:irq="17"/>
    <edc:Interrupt edc:cname="CNInterrupt" edc:desc="Change Notification Interrupt" edc:irq="19"/>
    <edc:Interrupt edc:cname="INT1Interrupt" edc:desc="INT1 - External Interrupt 1" edc:irq="20"/>
    <edc:Interrupt edc:cname="IC7Interrupt" edc:desc="IC7 - Input Capture 7" edc:irq="22"/>
    <edc:Interrupt edc:cname="IC8Interrupt" edc:desc="IC8 - Input Capture 8" edc:irq="23"/>
    <edc:Interrupt edc:cname="INT2Interrupt" edc:desc="INT2 - External Interrupt 2" edc:irq="29"/>
    <edc:Interrupt edc:cname="U1ErrInterrupt" edc:desc="U1E - UART1 Error" edc:irq="65"/>
  </edc:InterruptList>
  <edc:Breakpoints edc:hasdatacapture="true" edc:hwbpcount="0x2" edc:idbyte="r"/>
  <edc:ProgramSpace>
    <edc:ResetSector edc:beginaddr="0x0" edc:endaddr="0x4" edc:regionid="reset"/>
    <edc:VectorSector edc:beginaddr="0x04" edc:endaddr="0x100" edc:regionid="ivt"/>
    <edc:CodeSector edc:beginaddr="0x100" edc:endaddr="0x104" edc:isreserved="true" edc:regionid="_reserved"/>
    <edc:AltVectorSector edc:beginaddr="0x104" edc:endaddr="0x200" edc:regionid="aivt"/>
    <edc:CodeSector edc:beginaddr="0x200" edc:endaddr="0x2000" edc:regionid="program"/>
    <edc:TestZone edc:appbeginaddr="0x800080" edc:appendaddr="0x8005c0" edc:beginaddr="0x800000" edc:endaddr="0x801000" edc:regionid="testmem"/>
    <edc:ConfigFuseSector edc:beginaddr="0xf80000" edc:endaddr="0xf80010" edc:regionid="cfgmem">
      <edc:DCRDef edc:access="------------nnnn" edc:cname="FBS" edc:default="0x0f" edc:desc="" edc:impl="0xf" edc:name="FBS" edc:nzwidth="0x10" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xf">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="BWRP" edc:desc="Boot Segment Write Protect" edc:mask="0x1" edc:name="BWRP" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="WRPROTECT_OFF" edc:codeguardidref="PgmBootWrtProtectOff" edc:desc="Boot Segment may be written" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="WRPROTECT_ON" edc:codeguardidref="PgmBootWrtProtectOn" edc:desc="Boot segment is write-protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BSS" edc:desc="Boot Segment Program Flash Code Protection" edc:mask="0x7" edc:name="BSS" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="NO_FLASH" edc:codeguardidref="PgmBootNone" edc:desc="No Boot program Flash segment" edc:when="(field &amp; 0x7) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="NO_BOOT_CODE" edc:codeguardidref="NoBootCode" edc:desc="No Boot program Flash segment" edc:isidehidden="true" edc:when="(field &amp; 0x7) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="SMALL_FLASH_STD" edc:codeguardidref="PgmBootStdSm" edc:desc="Standard Security, Small-sized Boot Flash" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="STRD_SMALL_BOOT_CODE" edc:codeguardidref="StdSmBootCode" edc:desc="Standard Security, Small-sized Boot Flash" edc:isidehidden="true" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="MEDIUM_FLASH_STD" edc:codeguardidref="PgmBootStdMed" edc:desc="Standard Security, Medium-sized Boot Flash" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="STRD_MEDIUM_BOOT_CODE" edc:codeguardidref="StdMedBootCode" edc:desc="Standard Security, Medium-sized Boot Flash" edc:isidehidden="true" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="LARGE_FLASH_STD" edc:codeguardidref="PgmBootStdLarge" edc:desc="Standard Security, Large-sized Boot Flash" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="STRD_LARGE_BOOT_CODE" edc:codeguardidref="StdLarBootCode" edc:desc="Standard Security, Large-sized Boot Flash" edc:isidehidden="true" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="" edc:desc="No Boot program Flash segment" edc:isidehidden="true" edc:islanghidden="true" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="SMALL_FLASH_HIGH" edc:codeguardidref="PgmBootHighSm" edc:desc="High Security, Small-sized Boot Flash" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="HIGH_SMALL_BOOT_CODE" edc:codeguardidref="HiSmBootCode" edc:desc="High Security, Small-sized Boot Flash" edc:isidehidden="true" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="MEDIUM_FLASH_HIGH" edc:codeguardidref="PgmBootHighMed" edc:desc="High Security, Medium-sized Boot Flash" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="HIGH_MEDIUM_BOOT_CODE" edc:codeguardidref="HiMedBootCode" edc:desc="High Security, Medium-sized Boot Flash" edc:isidehidden="true" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="LARGE_FLASH_HIGH" edc:codeguardidref="PgmBootHighLarge" edc:desc="High Security, Large-sized Boot Flash" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="HIGH_LARGE_BOOT_CODE" edc:codeguardidref="HiLarBootCode" edc:desc="High Security, Large-sized Boot Flash" edc:isidehidden="true" edc:when="(field &amp; 0x7) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:AdjustPoint edc:offset="2"/>
      <edc:DCRDef edc:access="-------------nnn" edc:cname="FGS" edc:default="0x07" edc:desc="" edc:impl="0x7" edc:name="FGS" edc:nzwidth="0x10" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x7">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="GWRP" edc:desc="General Code Segment Write Protect" edc:mask="0x1" edc:name="GWRP" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:codeguardidref="PgmGenWrtProtectOff" edc:desc="User program memory is not write-protected" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:codeguardidref="PgmGenWrtProtectOn" edc:desc="User program memory is write-protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="GSS" edc:desc="General Segment Code Protection" edc:mask="0x3" edc:name="GSS" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:codeguardidref="PgmGenNone" edc:desc="User program memory is not code-protected" edc:when="(field &amp; 0x3) == 0x3">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x0" edc:endaddr="0x0"/>
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="GSS_OFF"/>
                  <edc:LegacyAlias edc:cname="GCP_OFF"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ON" edc:codeguardidref="PgmGenStd" edc:desc="Standard Security Code Protection is Enabled" edc:when="(field &amp; 0x3) == 0x2">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x27" edc:endaddr="0x2000"/>
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="GSS_STD"/>
                  <edc:LegacyAlias edc:cname="GCP_ON"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="HIGH" edc:codeguardidref="PgmGenHigh" edc:desc="High Security Code Protection is Enabled" edc:when="(field &amp; 0x3) == 0x1">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x27" edc:endaddr="0x2000"/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="--------n----nnn" edc:cname="FOSCSEL" edc:default="0x87" edc:desc="" edc:impl="0x87" edc:name="FOSCSEL" edc:nzwidth="0x10" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x87">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="FNOSC" edc:desc="Oscillator Mode" edc:mask="0x7" edc:name="FNOSC" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="LPRCDIVN" edc:desc="Internal Fast RC (FRC) with divide by N" edc:when="(field &amp; 0x7) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="FRCDIV16" edc:desc="Internal Fast RC (FRC) divide by 16" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="LPRC" edc:desc="Low Power RC Oscillator (LPRC)" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="SOSC" edc:desc="Secondary Oscillator (SOSC)" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="PRIPLL" edc:desc="Primary Oscillator (XT, HS, EC) w/ PLL" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="PRI" edc:desc="Primary Oscillator (XT, HS, EC)" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="FRCPLL" edc:desc="Internal Fast RC (FRC) w/ PLL" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="FRC" edc:desc="Internal Fast RC (FRC)" edc:when="(field &amp; 0x7) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:DCRFieldDef edc:cname="IESO" edc:desc="Internal External Switch Over Mode" edc:mask="0x1" edc:name="IESO" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Start-up device with FRC, then automatically switch to user-selected oscillator source when ready" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Start-up device with user-selected oscillator source" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="--------nnn--nnn" edc:cname="FOSC" edc:default="0xe7" edc:desc="" edc:impl="0xe7" edc:name="FOSC" edc:nzwidth="0x10" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xe7">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="POSCMD" edc:desc="Primary Oscillator Source" edc:mask="0x3" edc:name="POSCMD" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="NONE" edc:desc="Primary Oscillator Disabled" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="HS" edc:desc="HS Oscillator Mode" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="XT" edc:desc="XT Oscillator Mode" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="EC" edc:desc="EC Oscillator Mode" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="OSCIOFNC" edc:desc="OSC2 Pin Function" edc:mask="0x1" edc:name="OSCIOFNC" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="OSC2 pin has clock out function" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="OSC2 pin has digital I/O function" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:DCRFieldDef edc:cname="IOL1WAY" edc:desc="Peripheral Pin Select Configuration" edc:mask="0x1" edc:name="IOL1WAY" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Allow Only One Re-configuration" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Allow Multiple Re-configurations" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FCKSM" edc:desc="Clock Switching and Monitor" edc:mask="0x3" edc:name="FCKSM" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="CSDCMD" edc:desc="Both Clock Switching and Fail-Safe Clock Monitor are disabled" edc:when="(field &amp; 0x2) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="CSECMD" edc:desc="Clock switching is enabled, Fail-Safe Clock Monitor is disabled" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CSECME" edc:desc="Both Clock Switching and Fail-Safe Clock Monitor are enabled" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="--------nn-nnnnn" edc:cname="FWDT" edc:default="0xdf" edc:desc="" edc:impl="0xdf" edc:name="FWDT" edc:nzwidth="0x10" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xdf">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="WDTPOST" edc:desc="Watchdog Timer Postscaler" edc:mask="0xf" edc:name="WDTPOST" edc:nzwidth="0x4">
              <edc:DCRFieldSemantic edc:cname="PS32768" edc:desc="1:32,768" edc:when="(field &amp; 0xf) == 0xf"/>
              <edc:DCRFieldSemantic edc:cname="PS16384" edc:desc="1:16,384" edc:when="(field &amp; 0xf) == 0xe"/>
              <edc:DCRFieldSemantic edc:cname="PS8192" edc:desc="1:8,192" edc:when="(field &amp; 0xf) == 0xd"/>
              <edc:DCRFieldSemantic edc:cname="PS4096" edc:desc="1:4,096" edc:when="(field &amp; 0xf) == 0xc"/>
              <edc:DCRFieldSemantic edc:cname="PS2048" edc:desc="1:2,048" edc:when="(field &amp; 0xf) == 0xb"/>
              <edc:DCRFieldSemantic edc:cname="PS1024" edc:desc="1:1,024" edc:when="(field &amp; 0xf) == 0xa"/>
              <edc:DCRFieldSemantic edc:cname="PS512" edc:desc="1:512" edc:when="(field &amp; 0xf) == 0x9"/>
              <edc:DCRFieldSemantic edc:cname="PS256" edc:desc="1:256" edc:when="(field &amp; 0xf) == 0x8"/>
              <edc:DCRFieldSemantic edc:cname="PS128" edc:desc="1:128" edc:when="(field &amp; 0xf) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="PS64" edc:desc="1:64" edc:when="(field &amp; 0xf) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="PS32" edc:desc="1:32" edc:when="(field &amp; 0xf) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="PS16" edc:desc="1:16" edc:when="(field &amp; 0xf) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="PS8" edc:desc="1:8" edc:when="(field &amp; 0xf) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="PS4" edc:desc="1:4" edc:when="(field &amp; 0xf) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="PS2" edc:desc="1:2" edc:when="(field &amp; 0xf) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="PS1" edc:desc="1:1" edc:when="(field &amp; 0xf) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WDTPRE" edc:desc="WDT Prescaler" edc:mask="0x1" edc:name="WDTPRE" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="PR128" edc:desc="1:128" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="PR32" edc:desc="1:32" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="WINDIS" edc:desc="Watchdog Timer Window" edc:mask="0x1" edc:name="WINDIS" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Watchdog Timer in Non-Window mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Watchdog Timer in Window mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FWDTEN" edc:desc="Watchdog Timer Enable" edc:mask="0x1" edc:name="FWDTEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Watchdog timer always enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Watchdog timer enabled/disabled by user software" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
